zhenyagit/NRF52_Watch/main.c
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for starting advertising. */
static void advertising_start(void * p_erase_bonds)
{
    bool erase_bonds = *(bool*)p_erase_bonds;

    if (erase_bonds)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}


#if NRF_LOG_ENABLED
/**@brief Thread for handling the logger.
 *
 * @details This thread is responsible for processing log entries if logs are deferred.
 *          Thread flushes all log entries and suspends. It is resumed by idle task hook.
 *
 * @param[in]   arg   Pointer used for passing some arbitrary information (context) from the
 *                    osThreadCreate() call to the thread.
 */
static void logger_thread(void * arg)
{
    UNUSED_PARAMETER(arg);

    while (1)
    {
        NRF_LOG_FLUSH();

        vTaskSuspend(NULL); // Suspend myself
    }
}
#endif //NRF_LOG_ENABLED

/**@brief A function which is hooked to idle task.
 * @note Idle hook must be enabled in FreeRTOS configuration (configUSE_IDLE_HOOK).
 */
void vApplicationIdleHook( void )
{
#if NRF_LOG_ENABLED
     vTaskResume(m_logger_thread);
#endif
}


/**@brief Function for initializing the clock.
 */
static void clock_init(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
static void gpio_output_voltage_setup(void)
{
    // Configure UICR_REGOUT0 register only if it is set to default value.
    if ((NRF_UICR->REGOUT0 & UICR_REGOUT0_VOUT_Msk) ==
        (UICR_REGOUT0_VOUT_DEFAULT << UICR_REGOUT0_VOUT_Pos))
    {
        NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Wen;
        while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

        NRF_UICR->REGOUT0 = (NRF_UICR->REGOUT0 & ~((uint32_t)UICR_REGOUT0_VOUT_Msk)) |
                            (UICR_REGOUT0_VOUT_2V4 << UICR_REGOUT0_VOUT_Pos);

        NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren;
        while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

        // System reset is needed to update UICR registers.
        NVIC_SystemReset();
    }
}
void set_vol(uint8_t vol)//UICR_REGOUT0_VOUT_3V3
{
	if (NRF_POWER->MAINREGSTATUS & (POWER_MAINREGSTATUS_MAINREGSTATUS_High << POWER_MAINREGSTATUS_MAINREGSTATUS_Pos))
	{
	// Configure UICR_REGOUT0 register only if it is set to default value.
		if ((NRF_UICR->REGOUT0 & UICR_REGOUT0_VOUT_Msk) ==
		(UICR_REGOUT0_VOUT_DEFAULT << UICR_REGOUT0_VOUT_Pos))
		{
		NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Wen;
		while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}
			// System reset is needed to update UICR registers.
				NVIC_SystemReset();
		}
	}
}
int main(void)
{
    bool erase_bonds;
		nrf_gpio_cfg_output(PWpin);
		nrf_gpio_pin_clear(PWpin);
		nrf_delay_ms(700);
    // Initialize modules.
    log_init();
    clock_init();
		spi_init();
    // Do not start any interrupt that uses system functions before system initialisation.
    // The best solution is to start the OS before any other initalisation.

#if NRF_LOG_ENABLED
    // Start execution.
    if (pdPASS != xTaskCreate(logger_thread, "LOGGER", 256, NULL, 1, &m_logger_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#endif

    // Activate deep sleep mode.
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

    // Configure and initialize the BLE stack.
    ble_stack_init();
		//sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
		//sd_power_dcdc0_mode_set(NRF_POWER_DCDC_ENABLE);
		//set_vol(UICR_REGOUT0_VOUT_3V3);
    // Initialize modules.
    timers_init();
    buttons_leds_init(&erase_bonds);
    gap_params_init();
    gatt_init();
    advertising_init();	
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();
    application_timers_start();
		ST7789SetDrvSpi(&m_spi, ST7789FB8 ,&spi_xfer_done);
		ST7789Init();
		uint16_t color;
		color = RGB565(0, 0, 255);
		dispcolor_FillScreen(color);	
		uint32_t imageOffset = imgtest[10] | (imgtest[11] << 8) | (imgtest[12] << 16) | (imgtest[13] << 24);
		uint32_t imageWidth  = imgtest[18] | (imgtest[19] << 8) | (imgtest[20] << 16) | (imgtest[21] << 24);
		uint32_t imageHeight = imgtest[22] | (imgtest[23] << 8) | (imgtest[24] << 16) | (imgtest[25] << 24);
		uint16_t imagePlanes = imgtest[26] | (imgtest[27] << 8);

		uint16_t imageBitsPerPixel = imgtest[28] | (imgtest[29] << 8);
		uint32_t imageCompression  = imgtest[30] | (imgtest[31] << 8) | (imgtest[32] << 16) | (imgtest[33] << 24);
		int cursore=imageOffset;
		uint8_t imageRow[(240 * 3 + 3) & ~3];
		uint16_t PixBuff[240];

		for (uint32_t y = 0; y < imageHeight; y++)
		{
			memcpy(imageRow,imgtest+cursore, (imageWidth * 3 + 3) & ~3);
			cursore = cursore+((imageWidth * 3 + 3) & ~3) ;
				
			uint32_t rowIdx = 0;
			for (uint32_t x = 0; x < imageWidth; x++)
			{
				uint8_t b = imageRow[rowIdx++];
				uint8_t g = imageRow[rowIdx++];
				uint8_t r = imageRow[rowIdx++];
				PixBuff[x] = RGB565(r, g, b);
			}

			dispcolor_DrawPartXY(0, imageHeight - y - 1, imageWidth, 1, PixBuff);
		}
		dispcolor_DrawFont(0,0, WHITE, number0);
		dispcolor_DrawFont(0,50, WHITE, number1);
		dispcolor_DrawFont(0,100, WHITE, number2);
		dispcolor_DrawFont(0,150, WHITE, number3);

		//for (int i=0;i<240*240;i++)
		//{
		//	ST7789FB[i] = RGB565(imgtest[imageOffset+i*3],imgtest[imageOffset+i*3+1],imgtest[imageOffset+i*3+2]);
			//if (i%240==0) ST7789FB[i] = RGB565(250, 250, 250);
			//else ST7789FB[i] = RGB565(120, 0, 2);
			
		//}
		char* buffer = malloc(10);
			
		nrf_delay_ms(4000);
	/*
		ST7789FastClearScreen(ST7789FB8);
			dispcolor_FillScreen(RGB565(255,0,0));
			nrf_delay_ms(600);
			
		ST7789FastClearScreen(ST7789FB8);
			dispcolor_FillScreen(RGB565(0,255,0));
			nrf_delay_ms(600);
			
		ST7789FastClearScreen(ST7789FB8);
			dispcolor_FillScreen(RGB565(0,0,255));
			nrf_delay_ms(600);
			*/
		nrf_delay_ms(200);
		dispcolor_DrawCircle(120, 140, 50, RED);
		dispcolor_printf(10, 200, FONTID_16F, RGB565(255, 255, 255), "Watch_M1");
		sprintf(buffer,"%d",sizeof(imgtest));
		dispcolor_printf(10,150, FONTID_16F,RGB565(255,255,255),buffer);
		
		

		
    // Create a FreeRTOS task for the BLE stack.
    // The task will run advertising_start() before entering its loop.
    nrf_sdh_freertos_init(advertising_start, &erase_bonds);

    NRF_LOG_INFO("HRS FreeRTOS example started.");
    // Start FreeRTOS scheduler.
    vTaskStartScheduler();

    for (;;)
    {
        APP_ERROR_HANDLER(NRF_ERROR_FORBIDDEN);
    }
}


